#+title: Arrays

*** Submission 2
I found this solution online. They used 2 pointers instead of nested loops

#+begin_src js
const prices = [1, 2, 3, 4, 5];
return maxProfit(prices);

function maxProfit(prices) {
  let profit = 0;
  let leftPointer = 0;
  let rightPointer = 1;

  while (rightPointer < prices.length) {
    console.log(`${prices[rightPointer]} - ${prices[leftPointer]}`);
    if (prices[leftPointer] < prices[rightPointer]) {
      const currentProfit = prices[rightPointer] - prices[leftPointer];
      if (currentProfit > profit) {
        profit = currentProfit;
      }
    } else {
      leftPointer = rightPointer;
    }
    rightPointer++;
    console.log('----------');
  }
  return profit;
}
#+end_src

#+RESULTS:
: 2 - 1
: ----------
: 3 - 1
: ----------
: 4 - 1
: ----------
: 5 - 1
: ----------
: 4

** Submissions
Since the array can't be copied (i.e. using =filter=), my first thought was going
through the array and check if the current index is zero. If so, then I remove
it and place it at the end of the array

However, this solution didn't work for all cases

#+begin_src js
const zeroes = [0, 0, 1];
moveZeroes(zeroes)
return zeroes;

function moveZeroes(nums) {
    for (let i = 0; i < nums.length; i++) {
        if (nums[i] === 0) {
            const zero = nums.splice(i, 1);
            nums.push(zero)
        }
    }
};
#+end_src

#+RESULTS:
| 0 | 1 | (0) |

The =i= would skip elements after they are swapped. I fixed this just by decrementing =i= after the swap operation

#+begin_src js
const zeroes = [0, 0, 1];
moveZeroes(zeroes)
return zeroes;

function moveZeroes(nums) {
    for (let i = 0; i < nums.length; i++) {
        if (nums[i] === 0) {
            const zero = nums.splice(i, 1);
            nums.push(zero)
            i--;
        }
    }
};
#+end_src

#+RESULTS:
| 1 | (0) | (0) |

*** Submission 1
/Runtime: 65 ms/ - Beats 61.58%
/Memory: 44.1 MB/ - Beats 5.64%

This solution is too memory intensive

#+begin_src js
let candies = [2, 3, 5, 1, 3];
return kidsWithCandies(candies, 3);


/**
 * @param {number[]} candies
 * @param {number} extraCandies
 * @return {boolean[]}
 */
function kidsWithCandies(candies, extraCandies) {
  const candiesCopy = [...candies];
  const maxCandy = candies.sort((a, b) => a - b).reverse()[0];
  const results = [];
  for (let candy of candiesCopy) {
    results.push(candy + extraCandies >= maxCandy);
  }
  return results;
}
#+end_src

#+RESULTS:
| true | true | true | false | true |

*** Submission 2
/Runtime: 54 ms/ - Beats 95.86%
/Memory: 42.9 MB/ - Beats 11.58%

Way faster from having to do array operations. Also used the =max()= function.
Still pretty memory intensive though

#+begin_src js
let candies = [2, 3, 5, 1, 3];
return kidsWithCandies(candies, 3);

/**
 ,* @param {number[]} candies
 ,* @param {number} extraCandies
 ,* @return {boolean[]}
 ,*/
function kidsWithCandies(candies, extraCandies) {
  const maxCandy = Math.max(...candies);
  const results = [];
  for (let candy of candies) {
    results.push(candy + extraCandies >= maxCandy);
  }
  return results;
}


#+end_src

#+RESULTS:
| true | true | true | false | true |

*** Submission 3
/Runtime: 42 ms/ - Beats 99.92%
/Memory: 42.9 MB/ - Beats 11.58%

A lot faster. Still big use of memory

#+begin_src js
let candies = [2, 3, 5, 1, 3];
return kidsWithCandies(candies, 3);

/**
 ,* @param {number[]} candies
 ,* @param {number} extraCandies
 ,* @return {boolean[]}
 ,*/
function kidsWithCandies(candies, extraCandies) {
  const maxCandy = Math.max(...candies);
  return candies.map((candy) => candy + extraCandies >= maxCandy);
}
#+end_src

#+RESULTS:
| true | true | true | false | true |

** Submissions
This was a really easy problem. Here's my first solution:

#+begin_src js
return getconcatenation([1, 2, 3, 4])

function getconcatenation(nums) {
  return [...nums, ...nums]
}
#+end_src

#+RESULTS:
| 1 | 2 | 3 | 4 | 1 | 2 | 3 | 4 |

Turns out JavaScript also has a concatenation function =concat= that does the same
thing

#+begin_src js
return getconcatenation([1, 2, 3, 4])

function getconcatenation(nums) {
  return nums.concat(nums)
}

#+end_src

#+RESULTS:
| 1 | 2 | 3 | 4 | 1 | 2 | 3 | 4 |


*** Submission 1
/Runtime: 67 ms/ - Beats 60.22%
/Memory: 44.2 MB/ - Beats 9.69%

Relatively fast, but uses a lot of memory

#+begin_src js
const operations = ['--X', 'X++', 'X++'];
return finalValueAfterOperations(operations);

/**
 * @param {string[]} operations
 * @returns {number}
 */
function finalValueAfterOperations(operations) {
  let X = 0;
  for (let operation of operations) {
    operation.includes('+') ? X++ : X--;
  }
  return X;
}
#+end_src

#+RESULTS:
: 1

*** Submission 2
/Runtime: 68 ms/ - Beats 56.23%
/Memory: 43.9 MB/ - Beats 13.25%

#+begin_src js
const operations = ['--X', 'X++', 'X++'];
return finalValueAfterOperations(operations);

/**
 ,* @param {string[]} operations
 ,* @returns {number}
 ,*/
function finalValueAfterOperations(operations) {
  let X = 0;
  for (let operation of operations) {
    operation === 'X++' || operation === '++X' ? X++ : X--;
  }
  return X;
}
#+end_src

#+RESULTS:
: 1

*** Submission 3
/Runtime: 57 ms/ - Beats 92.84%
/Memory: 42.6 MB/ - Beats 78.68%

I removed the ternary condition and the function performed way better

#+begin_src js
const operations = ['--X', 'X++', 'X++'];
return finalValueAfterOperations(operations);

/**
 ,* @param {string[]} operations
 ,* @return {number}
 ,*/
function finalValueAfterOperations(operations) {
   let X = 0;
   for (let i = 0; i < operations.length; i++)  {
       if(operations[i] === 'X++' || operations[i] === '++X') {
           X++;
       }
       else if(operations[i] === 'X--' || operations[i] === '--X') {
           X--;
       }
   }
   return X;
};
#+end_src

#+RESULTS:
: 1
